---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.MaterialByConstruction
enum: Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType
source: html/b614bf20-7f12-a7f1-4b63-f151a6960c6f.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.MaterialByConstruction

The visualization material for the MassSurfaceData will be taken from the
 material assigned to the ConceptualConstructionType which is assigned to the
 MassSurfaceData.